Project/Toir/src/DataProcessors/торо_ПодборРемонтныхРаботОборудования/торо_ПодборРемонтныхРаботОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>торо_ПодборРемонтныхРаботОборудования</name>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ссылка</name>
    <type>
      <types>DocumentRef.торо_АктОВыполненииЭтапаРабот</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РемонтныеРаботы</name>
    <attributes>
      <name>РемонтыОборудования_ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выполнено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентВыполненияРабот</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РемонтнаяРабота</name>
      <type>
        <types>CatalogRef.торо_ТехнологическиеОперации</types>
        <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
      </type>
    </attributes>
    <attributes>
      <name>Родитель_ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТехКартаРемонта</name>
      <type>
        <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
        <types>CatalogRef.торо_ТехКарты</types>
      </type>
    </attributes>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Наряд</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Акт</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорБригада</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
        <types>CatalogRef.торо_РемонтныеБригады</types>
      </type>
    </attributes>
    <attributes>
      <name>НоваяОперация</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РемонтыОборудования</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
        <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРемонтныхРабот</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонтаВладелец</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.торо_ВнешнееОснованиеДляРабот</types>
        <types>DocumentRef.торо_НарядНаРегламентноеМероприятие</types>
        <types>DocumentRef.торо_ПланГрафикРемонта</types>
        <types>DocumentRef.торо_НарядНаВыполнениеРемонтныхРабот</types>
        <types>DocumentRef.торо_ГрафикРегламентныхМероприятийТОиР</types>
        <types>DocumentRef.торо_ВыявленныеДефекты</types>
        <types>DocumentRef.торо_АктОВыполненииЭтапаРабот</types>
        <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
      </type>
    </attributes>
    <attributes>
      <name>Завершен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеРемонта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>IDОсновного</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КрайняяДопустимаяДатаЗавершенияРемонта</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>КритичностьДефекта</name>
      <type>
        <types>CatalogRef.торо_КритичностьДефекта</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументИсточник</name>
      <type>
        <types>DocumentRef.торо_НарядНаРегламентноеМероприятие</types>
        <types>DocumentRef.торо_ПланГрафикРемонта</types>
        <types>DocumentRef.торо_НарядНаВыполнениеРемонтныхРабот</types>
        <types>DocumentRef.торо_ГрафикРегламентныхМероприятийТОиР</types>
        <types>DocumentRef.торо_АктОВыполненииРегламентногоМероприятия</types>
        <types>DocumentRef.торо_ВыявленныеДефекты</types>
        <types>DocumentRef.торо_АктОВыполненииЭтапаРабот</types>
        <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
        <types>DocumentRef.торо_АктПриемкиОборудования</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.торо_ВнешнееОснованиеДляРабот</types>
        <types>DocumentRef.торо_НарядНаРегламентноеМероприятие</types>
        <types>DocumentRef.торо_ПланГрафикРемонта</types>
        <types>DocumentRef.торо_НарядНаВыполнениеРемонтныхРабот</types>
        <types>DocumentRef.торо_ГрафикРегламентныхМероприятийТОиР</types>
        <types>DocumentRef.торо_ВыявленныеДефекты</types>
        <types>DocumentRef.торо_АктОВыполненииЭтапаРабот</types>
        <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Предписания</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлановаяДата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеРемонта</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.торо_ВнешнееОснованиеДляРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>Обработано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Project/Toir/src/InformationRegisters/торо_ВнешниеОснованияДляРабот/торо_ВнешниеОснованияДляРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ВнешниеОснованияДляРабот</name>
  <comment> //TOIR20-370: включенно индексирование для ID и ПлановаяДатаРемонта</comment>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ПлановаяДатаРемонта</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Обработано</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <resources>
    <name>гкс_ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>РемонтыОборудования_id</name>
    <comment>Не используется! РемонтыОборудования_ID искать в измерении ID</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ID</name>
    <comment>Содержит РемонтыОборудования_ID, несмотря на реквизит</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ОперацииВнешнихОснованийДляРабот/торо_ОперацииВнешнихОснованийДляРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ОперацииВнешнихОснованийДляРабот</name>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>Предписание_ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>РемонтнаяРабота</name>
    <type>
      <types>CatalogRef.торо_ТехнологическиеОперации</types>
      <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Родитель_ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/DataProcessors/торо_ПодборРемонтныхРаботОборудования/Forms/ФормаПодбораПредписанийОпераций/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПЕРЕМЕННЫЕ
&НаКлиенте
Перем ПараметрыТекущейСтроки;

&НаКлиенте
Перем ПараметрыТекущейСтрокиРемонтовОборудования;

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ОбъектРемонтаДляОтбора") Тогда
		ОбъектРемонтаДляОтбора = Параметры.ОбъектРемонтаДляОтбора;
	КонецЕсли;
	
	ЗаполнитьПредписания();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ФлажокОбработанныеПриИзменении(Элемент)	
	ЗаполнитьПредписания();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПредписания
&НаКлиенте
Процедура ПредписанияПриАктивизацииСтроки(Элемент)
	
	ТекДанные = Элементы.Предписания.ТекущиеДанные;
	
	Если Не ТекДанные = Неопределено И НЕ ТекДанные.ID = Неопределено
		И НЕ ТекДанные.ДокументОснование = ПредопределенноеЗначение("Документ.торо_ВыявленныеДефекты.ПустаяСсылка") 
		И НЕ торо_ОбщегоНазначенияКлиент.СравнитьПараметрыТекущейСтроки("СтрРемОборудования", Элементы.Предписания.ТекущаяСтрока, ПараметрыТекущейСтрокиРемонтовОборудования) Тогда
		
		торо_ОбщегоНазначенияКлиент.ЗапомнитьПараметрыТекущейСтроки("СтрРемОборудования", Элементы.Предписания.ТекущаяСтрока, ПараметрыТекущейСтрокиРемонтовОборудования);
		
		СписокРО = Элементы.Предписания.ВыделенныеСтроки;
		ЗаполнитьДеревоРемонтныхРабот(СписокРО);
		Элементы.ДеревоРемонтныхРабот.Развернуть(ДеревоРемонтныхРабот.ПолучитьЭлементы()[0].ПолучитьИдентификатор(),Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредписанияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ВыбрЗнач = Объект.Предписания.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	//Если Не ВыбрЗнач = Неопределено И Не ВыбрЗнач.Обработано Тогда
	Если Не ВыбрЗнач = Неопределено Тогда
		
		СтруктураПоиска = Новый Структура("РемонтыОборудования_ID", ВыбрЗнач.ID);
		
		СтруктураВыбора = Новый Структура();
		
		СтруктураВыбора.Вставить("ДокументОснование", ВыбрЗнач.ДокументОснование);
		СтрокаРемонтовОборудования = Новый Структура("ID, ПлановаяДата, Обработано, ОбъектРемонта, ОписаниеРемонта, Предписания",
		ВыбрЗнач.ID, ВыбрЗнач.ПлановаяДата, ВыбрЗнач.Обработано, ВыбрЗнач.ОбъектРемонта, ВыбрЗнач.ОписаниеРемонта, Истина);
		СтруктураВыбора.Вставить("СтрокаРемонтовОборудования", СтрокаРемонтовОборудования);
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ПредписанияВыборЗавершение", ЭтотОбъект, Новый Структура("СтруктураВыбора, СтруктураПоиска", СтруктураВыбора, СтруктураПоиска)), НСтр("es='¿Llevar todas las operaciones de la razón escogida exterior?';ru='Перенести все операции выбранного внешнего основания?';en='Transfer all operations of the selected external base?'"), РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПредписания()
	
	ОчиститьДеревоЗначений();
	Объект.Предписания.Очистить();
	Объект.РемонтныеРаботы.Очистить();
	
	Запрос = Новый Запрос;
	
	МенеджерВремТаб = новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВремТаб;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_Предписания.Регистратор КАК Регистратор,
	|	торо_Предписания.НомерСтроки КАК НомерСтроки,
	|	торо_Предписания.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_Предписания.ID КАК ID,
	|	торо_Предписания.Описание КАК Описание,
	|	торо_Предписания.ПлановаяДатаРемонта КАК ПлановаяДатаРемонта,
	|	торо_Предписания.Обработано КАК Обработано
	|ПОМЕСТИТЬ idПредписаний
	|ИЗ
	|	РегистрСведений.торо_ВнешниеОснованияДляРабот КАК торо_Предписания
	|ГДЕ
	|	торо_Предписания.Регистратор ССЫЛКА Документ.торо_ВнешнееОснованиеДляРабот
	|	И торо_Предписания.ОбъектРемонта = &ОбъектРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	idПредписаний.ОбъектРемонта КАК ОбъектРемонта,
	|	idПредписаний.ID КАК ID,
	|	idПредписаний.Описание КАК ОписаниеРемонта,
	|	idПредписаний.ПлановаяДатаРемонта КАК ПлановаяДатаРемонта,
	|	торо_ПредписанияСрезПоследних.Обработано КАК Обработано,
	|	idПредписаний.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ТаблицаПредписания
	|ИЗ
	|	idПредписаний КАК idПредписаний
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВнешниеОснованияДляРабот.СрезПоследних КАК торо_ПредписанияСрезПоследних
	|		ПО idПредписаний.ID = торо_ПредписанияСрезПоследних.ID
	|			И idПредписаний.ОбъектРемонта = торо_ПредписанияСрезПоследних.ОбъектРемонта
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ДатаНачала <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА idПредписаний.ПлановаяДатаРемонта >= &ДатаНачала
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ДатаОкончания <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА idПредписаний.ПлановаяДатаРемонта <= &ДатаОкончания
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &Обработано = ЛОЖЬ
	|				ТОГДА торо_ПредписанияСрезПоследних.Обработано = ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаПредписания.ОбъектРемонта КАК ОбъектРемонта,
	|	ТаблицаПредписания.ID КАК ID,
	|	ТаблицаПредписания.ОписаниеРемонта КАК ОписаниеРемонта,
	|	ТаблицаПредписания.ПлановаяДатаРемонта КАК ПлановаяДатаРемонта,
	|	ТаблицаПредписания.Обработано КАК Обработано,
	|	ТаблицаПредписания.Регистратор КАК Регистратор
	|ИЗ
	|	ТаблицаПредписания КАК ТаблицаПредписания";
	
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("Обработано", ФлажокОбработанные);
	Запрос.УстановитьПараметр("ОбъектРемонта", ОбъектРемонтаДляОтбора);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		ДобавлятьРемонт = Истина;
		
		Если ЗначениеЗаполнено(ДатаНачала) Тогда
			Если Выборка.ПлановаяДатаРемонта < ДатаНачала Тогда
				ДобавлятьРемонт = Ложь;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДатаОкончания) Тогда
			Если Выборка.ПлановаяДатаРемонта > ДатаОкончания Тогда
				ДобавлятьРемонт = Ложь;
			КонецЕсли;
		КонецЕсли;
		
		Если Не ДобавлятьРемонт Тогда 
			Продолжить;
		КонецЕсли;
		
		НовСтрокаРО = Объект.Предписания.Добавить();
		НовСтрокаРО.ID                = Выборка.ID;
		НовСтрокаРО.ОбъектРемонта     = Выборка.ОбъектРемонта;
		НовСтрокаРО.ПлановаяДата      = Выборка.ПлановаяДатаРемонта;
		НовСтрокаРО.ОписаниеРемонта   = Выборка.ОписаниеРемонта;
		НовСтрокаРО.ДокументОснование = Выборка.Регистратор;
		НовСтрокаРО.Обработано 		  = Выборка.Обработано;
		
	КонецЦикла;
	
	ЗапросОпер = Новый Запрос;
	ЗапросОпер.МенеджерВременныхТаблиц = МенеджерВремТаб;
	ЗапросОпер.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                   |	торо_Предписания.ID КАК ID,
	                   |	торо_Предписания.ОбъектРемонта КАК ОбъектРемонта,
	                   |	торо_Предписания.ПлановаяДатаРемонта КАК ПлановаДата,
	                   |	торо_Предписания.ОписаниеРемонта КАК ОписаниеРемонта
	                   |ПОМЕСТИТЬ ТаблицаРемонтовОборудования
	                   |ИЗ
	                   |	ТаблицаПредписания КАК торо_Предписания
	                   |;
	                   |
	                   |////////////////////////////////////////////////////////////////////////////////
	                   |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                   |	торо_ЗаявкаНаРемонтРемонтныеРаботы.ID КАК ID,
	                   |	торо_ЗаявкаНаРемонтРемонтныеРаботы.РемонтнаяРабота КАК РемонтнаяРабота,
	                   |	торо_ЗаявкаНаРемонтРемонтныеРаботы.Родитель_ID КАК Родитель_ID,
	                   |	торо_ЗаявкаНаРемонтРемонтныеРаботы.Количество КАК Количество,
	                   |	торо_ЗаявкаНаРемонтРемонтныеРаботы.Предписание_ID КАК Предписание_ID
	                   |ПОМЕСТИТЬ ТаблицаРемонтныхРабот
	                   |ИЗ
	                   |	РегистрСведений.торо_ОперацииВнешнихОснованийДляРабот КАК торо_ЗаявкаНаРемонтРемонтныеРаботы
	                   |ГДЕ
	                   |	торо_ЗаявкаНаРемонтРемонтныеРаботы.Регистратор ССЫЛКА Документ.торо_ВнешнееОснованиеДляРабот
	                   |;
	                   |
	                   |////////////////////////////////////////////////////////////////////////////////
	                   |ВЫБРАТЬ
	                   |	ТаблицаРемонтныхРабот.ID КАК ID,
	                   |	ТаблицаРемонтныхРабот.РемонтнаяРабота КАК РемонтнаяРабота,
	                   |	ТаблицаРемонтныхРабот.Родитель_ID КАК Родитель_ID,
	                   |	ТаблицаРемонтныхРабот.Количество КАК Количество,
	                   |	ТаблицаРемонтныхРабот.Предписание_ID КАК РемонтыОборудования_ID
	                   |ИЗ
	                   |	ТаблицаРемонтныхРабот КАК ТаблицаРемонтныхРабот
	                   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаРемонтовОборудования КАК ТаблицаРемонтовОборудования
	                   |		ПО ТаблицаРемонтныхРабот.Предписание_ID = ТаблицаРемонтовОборудования.ID";
	
	
	ТаблицаРемонтныхРабот = ЗапросОпер.Выполнить().Выгрузить();
	
	
	Для Каждого СтрокаТЧ Из ТаблицаРемонтныхРабот Цикл 
		
		НовСтрокаРР = Объект.РемонтныеРаботы.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрокаРР, СтрокаТЧ);
		
	КонецЦикла; 
		
КонецПроцедуры

&НаСервере
// Процедура выполняет первоначальное заполнение элемента формы "ДеревоРемонтныхРабот".
//
Процедура ЗаполнитьДеревоРемонтныхРабот(СписокРемонтовОборудования)
		
	ДеревоЗначение = РеквизитФормыВЗначение("ДеревоРемонтныхРабот");
	
	ДеревоЗначение.Строки.Очистить();
	
	Для Каждого СтрокаРемОборудования Из СписокРемонтовОборудования Цикл
		
		СтрокаРемонтовОборудования = Объект.Предписания.НайтиПоИдентификатору(СтрокаРемОборудования);
		
		Если СтрокаРемонтовОборудования = Неопределено Тогда
			
			Для Каждого СтрокаТЧ Из Объект.Предписания Цикл
				
				// 0 - й уровень дерева
				КорневаяСтрока = ДеревоЗначение.Строки.Добавить();
				КорневаяСтрока.РемонтнаяРабота = "Ремонтные работы";
				КорневаяСтрока.Картинка = 4;
				КорневаяСтрока.РемонтыОборудования_ID = СтрокаТЧ.ID;
				
				МассивСтрок  = Объект.РемонтныеРаботы.НайтиСтроки(Новый Структура("РемонтыОборудования_ID", СтрокаТЧ.ID));
				ТаблицаСтрок = Объект.РемонтныеРаботы.Выгрузить(МассивСтрок);
				
				ТекущиеЗначения = Новый Структура("Родитель_ID, РемонтыОборудования_ID, ID", КорневаяСтрока.Родитель_ID, КорневаяСтрока.РемонтыОборудования_ID, КорневаяСтрока.ID);
				торо_Ремонты.СоздатьВетвьДереваПоТабличнойЧасти(ДеревоЗначение, ТекущиеЗначения, ТаблицаСтрок);
				
			КонецЦикла; 
			
		Иначе
			
			КорневаяСтрока = ДеревоЗначение.Строки.НайтиСтроки(Новый Структура("РемонтнаяРабота", "Ремонтные работы"));
			Если КорневаяСтрока.Количество() = 0 Тогда
				// 0 - й уровень дерева
				КорневаяСтрока = ДеревоЗначение.Строки.Добавить();
				КорневаяСтрока.РемонтнаяРабота = "Ремонтные работы";
				КорневаяСтрока.Картинка = 4;
				//КорневаяСтрока.РемонтыОборудования_ID = СтрокаРемонтовОборудования.ID;
			Иначе
				КорневаяСтрока = КорневаяСтрока[0];
			КонецЕсли; 
			
			МассивСтрок  = Объект.РемонтныеРаботы.НайтиСтроки(Новый Структура("РемонтыОборудования_ID", СтрокаРемонтовОборудования.ID));
			ТаблицаСтрок = Объект.РемонтныеРаботы.Выгрузить(МассивСтрок);
			
			ТекущиеЗначения = Новый Структура("Родитель_ID, РемонтыОборудования_ID, ID", КорневаяСтрока.Родитель_ID, "", КорневаяСтрока.ID);
			торо_Ремонты.СоздатьВетвьДереваПоТабличнойЧасти(ДеревоЗначение, ТекущиеЗначения, ТаблицаСтрок);
		КонецЕсли; 
		
		Элементы.ДеревоРемонтныхРабот.НачальноеОтображениеДерева = НачальноеОтображениеДерева.РаскрыватьВсеУровни;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДеревоЗначение, "ДеревоРемонтныхРабот");
	
КонецПроцедуры

&НаКлиенте
Процедура ПредписанияВыборЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    СтруктураВыбора = ДополнительныеПараметры.СтруктураВыбора;
    СтруктураПоиска = ДополнительныеПараметры.СтруктураПоиска;
    
    
    Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
        МассивСтрок = Объект.РемонтныеРаботы.НайтиСтроки(СтруктураПоиска);
        
        МассивСтрокРемонтныхРабот = Новый Массив;
        Для каждого Элем Из МассивСтрок Цикл
            СтруктураДобавления = Новый Структура("РемонтнаяРабота, Количество, Родитель_ID, РемонтыОборудования_ID, ID", Элем.РемонтнаяРабота, Элем.Количество, Элем.Родитель_ID, Элем.РемонтыОборудования_ID, Элем.ID);
            
            МассивСтрокРемонтныхРабот.Добавить(СтруктураДобавления);
            
        КонецЦикла;
        
        СтруктураВыбора.Вставить("МассивСтрокРемонтныхРабот", МассивСтрокРемонтныхРабот);
        
    КонецЕсли;
    
    ОповеститьОВыборе(СтруктураВыбора);
    
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	Если Элементы.Предписания.ВыделенныеСтроки.Количество() > 0  Тогда
		Для каждого СтрокаДокументыОснования Из Элементы.Предписания.ВыделенныеСтроки Цикл
			ВыбрЗнач = Объект.Предписания.НайтиПоИдентификатору(СтрокаДокументыОснования);
			//Если Не ВыбрЗнач = Неопределено И Не ВыбрЗнач.Обработано Тогда
			Если Не ВыбрЗнач = Неопределено Тогда
				
				СтруктураПоиска = Новый Структура("РемонтыОборудования_ID", ВыбрЗнач.ID);
				
				СтруктураВыбора = Новый Структура();
				
				СтруктураВыбора.Вставить("ДокументОснование", ВыбрЗнач.ДокументОснование);
				СтрокаРемонтовОборудования = Новый Структура("ID, ПлановаяДата, Обработано, ОбъектРемонта, ОписаниеРемонта, Предписания",
				ВыбрЗнач.ID, ВыбрЗнач.ПлановаяДата, ВыбрЗнач.Обработано, ВыбрЗнач.ОбъектРемонта, ВыбрЗнач.ОписаниеРемонта, Истина);
				СтруктураВыбора.Вставить("СтрокаРемонтовОборудования", СтрокаРемонтовОборудования);
				
				ПоказатьВопрос(Новый ОписаниеОповещения("ПредписанияВыборЗавершение", ЭтотОбъект, Новый Структура("СтруктураВыбора, СтруктураПоиска", СтруктураВыбора, СтруктураПоиска)), НСтр("es='¿Llevar todas las operaciones de la razón escogida exterior?';ru='Перенести все операции выбранного внешнего основания?';en='Transfer all operations of the selected external base?'"), РежимДиалогаВопрос.ДаНет);
				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	ЗаполнитьПредписания();
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	ЗаполнитьПредписания();
КонецПроцедуры

&НаСервере
Процедура ОчиститьДеревоЗначений()
   тДерево = РеквизитФормыВЗначение("ДеревоРемонтныхРабот");
 
   тДерево.Строки.Очистить();
 
   ЗначениеВРеквизитФормы(тДерево, "ДеревоРемонтныхРабот");
КонецПроцедуры

#КонецОбласти
